# Makefile για μεταγλώττιση έργων με περισσότερα από ένα αρχεία.
# Οι φάκελοι του έργου πρέπει να είναι οργανωμένοι ως εξής:
# 1. Στον κεντρικό φάκελο βρίσκεται το Makefile και οι υποφάκελοι
# src και obj
# 2. Ο πηγαίος κώδικας βρίσκεται στον υποφάκελο ./src
# 3. Τα αρχεία επικεφαλίδας βρίσκονται στον υποφάκελο ./src/incl
# 4. Τα αρχεία .o θα τοποθετηθούν στον υποφάκελο ./obj
# 5. Το εκτελέσιμο θα τοποθετηθεί στον κεντρικό φάκελο του έργου
# Οι κατάλογοι αυτοί πρέπει να έχουν δημιουργηθεί από το χρήστη.
# Εκτέλεση: Windows: mingw32-make Linux: make

# Μεταβλητές που περιέχουν απαραίτητες για τη μεταγλώττιση τιμές
# Η CFLAGS έχει τιμή τις παραμέτρους της μεταγλώττισης
# Η CC έχει τιμή τον μεταγλωττιστή που θα χρησιμοποιηθεί
# Η SRC έχει τιμή το φάκελο που βρίσκεται ο πηγαίος κώδικας
# Η ODIR έχει τιμή το φάκελο που θα τοποθετηθούν τα αρχεία
αντικείμενα
IDIR = ./src/incl
CC = gcc
CFLAGS = -I$(IDIR) -std=c17 -Wall -Wextra -Wpedantic -fanalyzer -g -
O2
SRC = ./src
ODIR = ./obj

# Αν χρειάζεται, εδώ δίνουμε φάκελο που περιέχει
# βιβλιοθήκες που χρειάζονται στη μεταγλώττιση
# LDIR =./lib

# Οι βιβλιοθήκες που τυχόν χρειάζεται να συνδεθούν με σαφήνεια
# LIBS = -lm

# Δήλωση αρχείου επικεφαλίδας
DEPS = $(IDIR)/fifo_arr.h
# Το όνομα του εκτελέσιμου
EXEC = fifo
# Η μεταβλητή OBJS περιέχει τα αρχεία .o από τα οποία
# εξαρτάται η δημιουργία του εκτελέσιμου
OBJS = $(ODIR)/fifo_arr.o $(ODIR)/fifo_client.o
# Η μεταβλητή ARGS περιέχει τις παραμέτρους εισόδου
ARGS =
# Εξαρτήσεις αρχείων .o από πηγαίο κώδικα και αρχεία επικεφαλίδας
# Τα .ο αρχεία θα τοποθετηθούν στον κατάλογο ../obj
# (θα δημιουργηθεί αν δεν υπάρχει)
$(ODIR)/%.o: $(SRC)/%.c $(DEPS)
@if not exist "$(ODIR)" mkdir "$(ODIR)"
$(CC) -c $< -o $@ $(CFLAGS)

# Δήλωση εξαρτήσεων για το εκτελέσιμο και τρόπος σύνδεσης αρχείων
.o
$(EXEC): $(OBJS)
$(CC) $(CFLAGS) $(OBJS) -o $(EXEC) $(LIBS)

# Ετικέτα για την εκτέλεση του προγράμματος.
# mingw32-make run (Windows) ή make run (Linux)
run: $(EXEC)
./$(EXEC) $(ARGS)

# Διαγραφή .ο αρχείων, καταλόγου και εκτελέσιμου:
# Windows: mingw32-make clean (Windows)
clean:
rd /s /q "$(ODIR)"
del /q $(EXEC).exe

# Linux: make clean
# clean:
# rm -f $(ODIR)/*.o *~ core $(IDIR)/*~
# rm $(EXEC)
